[{
  "title": "Spot bitcoin ETFs have now been approved. What comes next?",
  "source": "Sarah Wynn",
  "date": "January 10, 2024, 5:32PM EST",
  "content": [
    "Bitcoin  BTC \n      +2.30%\n      exchange-traded funds are set to start trading as early as Thursday after final registration statements went effective following a months-long approval process with the Securities and Exchange Commission — leaving some to wonder what's next.",
    "The past few weeks in itself have been eventful leading up to the approvals, but the intrigue doesn't stop there as experts weigh in on what billions of dollars in flows could look like in the coming days and weeks, if a spot ether ETF is next and if this changes the regulatory landscape for crypto.",
    "Flows over the next few weeks",
    "All eyes will be on the expected inflows within the first 24 to 48 hours, said Anthony Rousseau, head of brokerage solutions at multi-asset trading platform TradeStation, in a statement.",
    "\"Projections range from substantial to record-breaking, with some envisioning flows in the multiple billions—an unprecedented feat in the ETF realm,\" Rousseau said.",
    "Rousseau also warned of potentially underestimating long-term implications for the bitcoin market. Financial institutions have over $100 trillion in assets under management, and a portion of those funds could be allocated to bitcoin, Rousseau said.",
    "\"It's crucial to recognize that institutions can follow due process and navigate regulatory hoops to incorporate Bitcoin into their investment strategies, a journey that could span several months,\" Rousseau said.",
    "Other experts expect some volatility over the next few days. Spot bitcoin ETFs are expected to track the underlying bitcoin, but those ETFs are large and will be having lots of new AUM investment coming in in that first day or two after trading, said Stuart Barton, co-founder at Volatility Shares in an interview.",
    "\"It is possible that we might see the ETFs struggle to get the exposure in the bitcoin markets,\" Barton said. \"We know the bitcoin market might be 10-20 billion dollars a day typically. If 40-50 billion dollars poured into these ETFs on day one, it might be difficult for the advisers to get a hold of that amount of bitcoin.\"",
    "Will all the ETFs be ready to launch?",
    "The race for spot bitcoin ETFs has gotten very competitive, with multiple applicants slashing fees over the last few days. BlackRock shrunk its sponsor fee for its spot bitcoin ETF from 0.3% to 0.25%, while Ark Invest/21Shares also cut its fee from 0.25% to 0.21%.",
    "Many of the issuers looking to launch have made the decision to lower fees, which have gotten so low it leaves the question of whether it is still a good business opportunity, Barton said.",
    "Barton said it's possible that one or two of the spot bitcoin ETFs won't launch on Thursday, one could launch late, some never launch — or they could all launch.",
    "Keep up with the latest news, trends, charts and views on crypto and\n          DeFi with a new biweekly newsletter from The Block's Frank Chaparro",
    "\"If you launch late, it's just one more thing that might make the decision to not launch at all easier,\" Barton said.",
    "Are spot ether ETFs next?",
    "\"Once the sugar high from spot bitcoin ETF approval wears off, I expect the focus to quickly shift towards spot ether ETFs,\" said Nate Geraci, president of investment advisor The ETF Store.",
    "Big name firms, such as Fidelity and BlackRock, have also applied for a spot Ethereum ETF over the last few months. A month earlier, ether futures ETFs went live, marking the first ever ETFs to launch based on ether futures and two years after the launch of the first bitcoin futures ETF.",
    "Also potentially adding fuel to the proverbial spot crypto ETF fire was a decision made by three judges in a D.C. court over the summer which ruled that the SEC had to re-review Grayscale's bit for a spot bitcoin ETF after the asset management firm sued the agency last year following the rejection of its plan for the conversion of its flagship GBTC fund.",
    "\"That was critical because, combined with Grayscale’s court victory and SEC approval of spot bitcoin ETFs, the agency will now have a difficult time rejecting spot ether ETFs without exposing themself to another lawsuit,\" Geraci said.",
    "Stuart Barton, co-founder at Volatility Shares, was also optimistic.",
    "\"The fact that they allowed listing of the futures based ETFs is enough to say they are thinking about ether the same way they are thinking about bitcoin and you can infer from that they're probably thinking it's not a security and not going to regulate it that way,\" Barton said.",
    "SEC's stance on crypto",
    "SEC Chair Gary Gensler has been critical of crypto and up until Tuesday has been issuing warnings about crypto generally on X.",
    "The SEC's approval of spot bitcoin ETFs hinges on the Grayscale opinion, said Coy Garrison, partner at Steptoe and former counsel to SEC Commissioner Hester Peirce.",
    "\"The judiciary serves a vital role in reminding the SEC that it must operate within the bounds of its statutory authority,\" Garrison said. \"The SEC’s stance on crypto under Chair Gensler will likely only change when and if required to do so by a court.\"",
    "Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in other companies in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current financial disclosures.",
    "© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.",
    "Crypto voters would pick Democrats in Congress and Trump for president, a recent poll found",
    "Fidelity joins race to file updated spot bitcoin ETF forms with SEC, sets fund's sponsor fee at a low 0.39%"
  ]
}
,{
  "title": "South Korea reiterates ban on crypto ETFs despite US approval: report",
  "source": "Danny Park",
  "date": "January 11, 2024, 3:19AM EST",
  "content": [
    "South Korea’s top financial regulator said today that it will stand by its rule that restricts financial institutions from launching cryptocurrency exchange-traded funds, local media reported.",
    "An official of the country’s Financial Services Commission told local news outlet Kyunghyang that the approval of spot bitcoin ETFs in the U.S. is not an event that would prompt the Korean regulator to lift the ban or reconsider it. The report cited the stability of the financial markets and investor protection as reasons for upholding the current restrictions.",
    "The country’s capital markets act currently limits the scope of underlying assets for investment contract securities, such as ETFs, to financial investment instruments, currencies and ordinary commodities, which does not include crypto. South Korea does not acknowledge cryptocurrencies as financial assets and has banned financial institutions from investing in crypto since 2017.",
    "Keep up with the latest news, trends, charts and views on crypto and\n          DeFi with a new biweekly newsletter from The Block's Frank Chaparro",
    "South Korea is developing a two-part crypto regulation, with the first part passed last year and set to go into effect in July 2024. It is constructing the second part of its crypto act, which aims to set clear rules regarding the issuance, listing and delisting of cryptocurrencies.",
    "The FSC did not immediately respond to The Block’s enquiry for comments.",
    "Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in other companies in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current financial disclosures.",
    "© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.",
    "Bitcoin ETF approvals may have bigger impact on Asia, says Animoca cofounder Yat Siu",
    "SEC Chair Gary Gensler asked by senators to address X security breach"
  ]
}
,{
  "title": "Robinhood plans to list spot bitcoin ETFs as quickly as it can",
  "source": "MK Manoylov",
  "date": "January 10, 2024, 6:04PM EST",
  "content": [
    "Vlad Tenev, CEO of the investment app Robinhood, said that the firm will begin offering spot bitcoin exchange-traded funds as quickly as it can.",
    "The statement came right after the Securities and Exchange Commission announced the approval of spot bitcoin ETFs for the first time. Now, 11 spot bitcoin ETFs will be start trading as soon as tomorrow.",
    "\"Exciting update from Washington today! As a pioneer in offering spot crypto trading, Robinhood is thrilled about the SEC's decision to approve spot Bitcoin ETFs,\" Tenev wrote on the social media platform X.\"",
    "\"We've been ahead of the curve in crypto access, and we plan to list these ETFs on Robinhood as soon as possible,\" Tenev added. \"This milestone enhances the integration of cryptocurrencies with traditional finance. It not only offers clarity but also opens avenues for sophisticated risk management tools that benefit our customers in managing their digital asset investments.\"",
    "Risk management strategies",
    "Keep up with the latest news, trends, charts and views on crypto and\n          DeFi with a new biweekly newsletter from The Block's Frank Chaparro",
    "Tenev said that Robinhood has educational materials on bitcoin, ETFs and risk management strategies.",
    "Robinhood, which offers cryptocurrency trading on its platform, said last month that volumes had surged  amid an ongoing rally.",
    "The 11 tradable spot bitcoin ETFs approved on Wednesday include funds from Bitwise, Grayscale, Hashdex, BlackRock, Valkyrie, BZX, Invesco, VanEck, WisdomTree, Fidelity and Franklin Templeton.",
    "Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in other companies in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current financial disclosures.",
    "© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.",
    "Bitcoin price rises above $47,000 after SEC approval of spot BTC ETFs",
    "CoinGecko's X account hacked, posts fraudulent token airdrop"
  ]
}
,{
  "title": "Gary Gensler hasn't changed his tone on crypto, even with SEC approval of spot bitcoin ETFs",
  "source": "Sarah Wynn",
  "date": "January 10, 2024, 5:01PM EST",
  "content": [
    "Securities and Exchange Commission Chair Gary Gensler said Wednesday that the agency he leads was not endorsing bitcoin as it approved spot ETFs that hold the cryptocurrency, but he said changing circumstances had pushed the SEC to finally give the greenlight.",
    "Following a decision made by three judges in a D.C. court over the summer which ruled that the SEC had to re-review a bid from Grayscale Investments for a spot bitcoin ETF, Gensler said it was time to move forward.",
    "\"Based on these circumstances and those discussed more fully in the approval order, I feel the most sustainable path forward is to approve the listing and trading of these spot bitcoin ETP shares,\" Gensler said in a statement.",
    "That doesn't mean Gensler is changing his mind about crypto. The decision to approve spot bitcoin ETFs \"should in no way signal the Commission’s willingness to approve listing standards for crypto asset securities.\"",
    "\"Nor does the approval signal anything about the Commission's views as to the status of other crypto assets under the federal securities laws or about the current state of non-compliance of certain crypto asset market participants with the federal securities laws,\" Gensler added. \"As I’ve said in the past, and without prejudging any one crypto asset, the vast majority of crypto assets are investment contracts and thus subject to the federal securities laws.\"",
    "'Investors should remain cautious'",
    "Gensler also noted that the approval does not mean the SEC is endorsing bitcoin.",
    "\"While we approved the listing and trading of certain spot bitcoin ETP shares today, we did not approve or endorse bitcoin,\" he said. \"Investors should remain cautious about the myriad risks associated with bitcoin and products whose value is tied to crypto.\"",
    "Spot bitcoin ETFs will offer certain protections, Gensler said, including requiring sponsors to provide full and fair disclosures, and will be on regulated exchanges that have rules designed to prevent fraud and manipulation.",
    "Commissioners weigh in",
    "\"This saga likely would have spanned well beyond a decade were it not for the DC Circuit-ex-machina,\" said Republican SEC Commissioner Hester Peirce.",
    "Keep up with the latest news, trends, charts and views on crypto and\n          DeFi with a new biweekly newsletter from The Block's Frank Chaparro",
    "Peirce criticized the agency's past treatment of spot bitcoin ETFs and said it will harm the agency's reputation beyond crypto. Specifically, Peirce lambasted the SEC's \"disproportionate attention\" on the filings and said it was likely that over the past 10 years \"millions of dollars of staff time has gone toward blocking these applications.\"",
    "Fellow Republican SEC Commissioner Mark Uyeda said he was concerned about a few aspects of the agency's approval order, including the \"invention of a new standard.\"",
    "\"The Commission’s rationale and legal analysis in the Approval Order may serve as precedent for future matters that come before the Commission,\" Uyeda said. \"Even though the Commission is approving the listing applications in this instance, the underlying analytical approach effectively amounts to merit regulation.\"",
    "Uyeda and Peirce both supported the approvals.",
    "Democratic Commissioner Caroline Crenshaw issued a dissent on the approval and said the spot market underlying the spot bitcoin ETFs are fraught with fraud and manipulation without enough oversight.",
    "\"I am deeply concerned about today’s actions,\" Crenshaw said. \"I am concerned that these products will flood the markets and land squarely in the retirement accounts of U.S. households who can least afford to lose their savings to the fraud and manipulation that appears prevalent in the spot bitcoin markets and will impact the ETPs.\"",
    "Ultimately, Gensler, Peirce and Uyeda voted to approve the spot bitcoin ETFs in an \"order granting accelerated approval.\" Democratic Commissioner Jaime Lizárraga and Crenshaw voted against.",
    "(Updated at 5:15 p.m. ET to include other commissioners' comments.)",
    "(Updated at 6:10 p.m. ET to include vote.)",
    "Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in other companies in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current financial disclosures.",
    "© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.",
    "Crypto voters would pick Democrats in Congress and Trump for president, a recent poll found",
    "Fidelity joins race to file updated spot bitcoin ETF forms with SEC, sets fund's sponsor fee at a low 0.39%"
  ]
}
,{
  "title": "Coinbase calls spot bitcoin ETF approval 'watershed moment'",
  "source": "RT Watson",
  "date": "January 10, 2024, 6:09PM EST",
  "content": [
    "Cryptocurrency exchange Coinbase, which has long been at loggerheads with the Securities and Exchange Commission, cheered the regulator's decision to approve a host of spot bitcoin ETFs on Wednesday.",
    "\"The SEC’s approval of 11 spot bitcoin ETFs, eight of which are partnered with Coinbase, is a watershed moment for the expansion of the cryptoeconomy,\" the company said in a blog post. \"Spot bitcoin ETFs introduced by the world’s largest asset managers will unlock diversified pools of new investors to spur long-term growth and product innovation.\"",
    "Spot bitcoin ETFs using Coinbase as custodian. Image: The Block.",
    "'Grateful to Grayscale'",
    "After months of speculation and with a deadline looming, the SEC approved 11 spot bitcoin ETFs on Wednesday. Trading on the newly approved financial instruments that allow investors to wager on the price of bitcoin without having to own it directly is expected to start tomorrow.",
    "Keep up with the latest news, trends, charts and views on crypto and\n          DeFi with a new biweekly newsletter from The Block's Frank Chaparro",
    "Traditional financial institutions like BlackRock and Grayscale are among the companies that are offering the exchange traded funds.",
    "Coinbase and the SEC have had their fair share of public battles, but in this case the cryptocurrency exchange appears pleased with the regulator's decision.",
    "\"We should all be grateful to Grayscale for pushing back against the SEC’s arbitrary and capricious behavior, and clearing the way to get these spot  BTC \n      +2.30%\n      ETFs over the finish line,\" Coinbase's Chief Legal Officer Paul Grewal posted to X following the regulator's decision.",
    "Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in other companies in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current financial disclosures.",
    "© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.",
    "Ripple initiating $285 million share buyback that values company at $11 billion",
    "X appears to be phasing out NFT profile picture support"
  ]
}
,{
  "title": "Bitcoin price rises above $47,000 after SEC approval of spot BTC ETFs",
  "source": "MK Manoylov",
  "date": "January 10, 2024, 4:58PM EST",
  "content": [
    "The price of bitcoin didn't immediately react much to the Securities and Exchange Commission's approval of spot bitcoin exchange-traded funds, but it ticked back up above $47,000 in late day trading.",
    "Bitcoin  BTC \n      +2.30%\n     's price traded hands at $47,107 at 6:28 p.m. ET on Jan. 10, hours after after the SEC officially announced the approval of spot bitcoin ETFs. The world's most popular cryptocurrency by market capitalization saw a 2.1% increase in the last 24 hours, according to The Block's Price Page for bitcoin.",
    "Price of bitcoin following the SEC's approval of spot bitcoin ETFs. Image: The Block's Price Page for bitcoin",
    "Yesterday stole the thunder",
    "On Jan. 9, the SEC's X account was compromised. An unprotected phone number allowed the hacker to gain control of the regulator's account and falsely state that spot bitcoin ETFs had been approved.",
    "Though the SEC soon corrected the narrative, the price of bitcoin jumped to nearly $48,000 before falling to $45,000. This wild price action may have stolen the thunder from today's news.",
    "Keep up with the latest news, trends, charts and views on crypto and\n          DeFi with a new biweekly newsletter from The Block's Frank Chaparro",
    "Ether price rallies",
    "The price of ether had a different reaction though. Its price has risen from $2,300 at the start of the day to $2,530 currently, according to The Block's Price Page.",
    "The price of ether rallied upon the SEC's approval of multiple spot bitcoin ETFs. Image: The Block's Price Page.",
    "Unlike bitcoin, ether rallied following the spot bitcoin ETF approval announcement. It rose around $70 following the news.",
    "Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in other companies in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current financial disclosures.",
    "© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.",
    "Robinhood plans to list spot bitcoin ETFs as quickly as it can",
    "CoinGecko's X account hacked, posts fraudulent token airdrop"
  ]
}
,{
  "title": "Spot bitcoin ETFs can start trading as SEC clears final hurdle",
  "source": "Tim Copeland",
  "date": "January 10, 2024, 5:17PM EST",
  "content": [
    "Spot bitcoin ETF applicants have seen their S-1 forms go effective, according to Bitwise CIO Matt Hougan, meaning that trading of these products can get started as early as tomorrow.",
    "Final versions of the prospectuses are now appearing on the SEC's website, including BlackRock's iShares Bitcoin  BTC \n      +2.30%\n      ETF and Ark Invest/21Shares.",
    "The timing matches an earlier release by Grayscale that said it expected the SEC to declare its Form-3 registration statement effective at 5pm ET.",
    "Bitwise posted on X that the Bitwise Bitcoin ETF with the ticker BITB will start trading on January 11. It also said it plans to donate 10% of profits from the fund to Bitcoin open-source development.",
    "“We expect significant demand for bitcoin ETFs like BITB,” said Bitwise CEO Hunter Horsley in a statement. “Every year for the past six years, financial advisors have identified ETFs as their preferred way to help clients access bitcoin. Last year, 64% of financial advisors preferred a spot bitcoin ETF over existing vehicles. Across our existing client base of thousands of investment professionals, we hear the same thing. Now, at long last, a spot bitcoin ETF is arriving.”",
    "This comes shortly after the applicants saw their 19b-4 forms approved all in one go, a pivotal moment in the approval process. A document was published to the SEC website, approving 11 spot bitcoin ETFs by Bitwise, Grayscale, Hashdex, BlackRock, Valkyrie, BZX, Invesco, VanEck, WisdomTree, Fidelity and Franklin.",
    "Alongside the omnibus approval order, the SEC published a speech by Chair Gary Gensler. He confirmed the approvals but added a warning. \"While we approved the listing and trading of certain spot bitcoin ETP shares today, we did not approve or endorse bitcoin. Investors should remain cautious about the myriad risks associated with bitcoin and products whose value is tied to crypto,\" he said.",
    "Earlier today, the Cboe BZX exchange sent letters to the Securities and Exchange Commission on Wednesday, requesting “acceleration of registration” for proposed spot bitcoin ETFs. A few hours later, it issued listing notifications for six prospective ETFs saying that trading would begin on Thursday. This was prior to any approvals by the SEC.",
    "BlackRock ready to trade",
    "BlackRock said in a statement that trading in its spot bitcoin fund was expected to begin on Thursday.",
    "Keep up with the latest news, trends, charts and views on crypto and\n          DeFi with a new biweekly newsletter from The Block's Frank Chaparro",
    "\"Through IBIT, investors can access bitcoin in a cost-effective and convenient way,\" said Dominik Rohe, Head of Americas iShares ETF and Index Investing business at BlackRock.",
    "Valkyrie Investments and VanEck have also both said they expect trading to begin on Thursday. Those comments were made ahead of the approvals.",
    "Valkyrie co-founder and CIO Steven McClurg said he expects $200 million to $400 million of investors’ funds coming to Valkyrie’s ETF, and all participants might see $4 to $5 billion of inflows over the first couple of weeks.",
    "VanEck estimated that $1 billion of funds would flow into these products over the first few days, and $2.4 billion within a quarter. Galaxy anticipates inflows of $14 billion within the first year. Bitwise said it reckons the market for spot bitcoin ETFs will reach roughly $72 billion within five years.",
    "The issue of each product's sponsor fee could help determine where the funds flow. Currently, Bitwise is offering the cheapest ETF, with a fee of 0.2%. Ark/21Shares is offering a similarly low fee of 0.25%, while BlackRock is offering a reasonably competitive 0.3%. Multiple spot bitcoin ETF issuers have also offered discounts for the first funds that arrive to their products, with many firms offering zero fees for the first billion — or several billions — of dollars of inflows.",
    "Final touches",
    "Over the last few weeks, such applicants had filed multiple amendments to their spot bitcoin ETF applications as they addressed many of the SEC's concerns involving creation and redemption models, authorized participants and how to manage hard forks and airdrops.",
    "On Tuesday, the SEC’s X account was compromised and a post went out claiming the SEC had granted approval for listing bitcoin ETFs on all registered securities exchanges with an image showing a quote by SEC Chair Gary Gensler. It was shortly deleted with follow up posts claiming it was unauthorized and that spot bitcoin ETFs had not been approved by that point.",
    "Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in other companies in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current financial disclosures.",
    "© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.",
    "SEC approves 11 spot bitcoin ETFs, with trading likely set to start tomorrow",
    "SEC decision on spot bitcoin ETFs expected to come today: Here’s what we know"
  ]
}
,{
  "title": "Hong Kong lawmaker calls for swift action following US spot bitcoin ETF greenlight",
  "source": "Timmy Shen",
  "date": "January 10, 2024, 11:17PM EST",
  "content": [
    "A Hong Kong lawmaker urged the local government to quickly follow suit after the U.S. approved spot bitcoin exchange-traded funds earlier today.",
    "Johnny Ng, a member of the Hong Kong Legislative Council, wrote today in a post on X that Hong Kong should also “take the lead” in the crypto space by fostering innovation.",
    "“The Securities and Futures Commission had previously expressed readiness to accept applications for spot bitcoin ETFs,” Ng said. “I hope that Hong Kong, amidst rapid development and intense competition in the virtual asset sector, can swiftly secure a position globally, particularly by taking the lead in implementing relevant policies and products in Asia.”",
    "“This presents an opportunity to solidify Hong Kong’s position as a global hub for virtual assets,” he added.",
    "Getting ready",
    "Keep up with the latest news, trends, charts and views on crypto and\n          DeFi with a new biweekly newsletter from The Block's Frank Chaparro",
    "In December, Hong Kong’s Securities and Futures Commission and the Hong Kong Monetary Authority, the city’s de facto central bank, announced that both agencies have reviewed their existing policy. The regulators published two circulars addressing the requirements for spot crypto ETFs.",
    "Livio Weng, COO of Hong Kong-based crypto exchange HashKey, said Wednesday that 10 fund managers, including those backed by Chinese capital, are looking into launching spot crypto ETFs in the city.",
    "Ng also urged the Hong Kong government to prioritize crypto education. “The SAR government should immediately enhance public education, aiming to both increase the public’s awareness of virtual assets and reduce the opportunities for unlawful individuals to exploit virtual assets for fraudulent activities,” he said in the post.",
    "Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in other companies in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current financial disclosures.",
    "© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.",
    "Crypto leaders foresee maturation after spot bitcoin ETF approval amid volatility concerns",
    "10 asset managers in Hong Kong are exploring potential spot crypto ETFs: HashKey COO"
  ]
}
,{
  "title": "Bitcoin ETF approvals may have bigger impact on Asia, says Animoca cofounder Yat Siu",
  "source": "Danny Park",
  "date": "January 10, 2024, 11:42PM EST",
  "content": [
    "The long-awaited spot bitcoin ETF approval earlier today in the U.S. will likely have a bigger impact on crypto development in Asia, co-founder of Hong Kong-based crypto venture capital firm Animoca Brands, Yat Siu told The Block in an interview Wednesday.",
    "This landmark approval from the U.S. Securities and Exchange Commission — whose chair Gary Gensler holds a rather unfavorable view towards crypto — is expected to create a rush of new capital into the industry as spot bitcoin ETFs will act as a safer and more secure vehicle for the crypto-curious, industry leaders said.",
    "While the SEC’s decision may drive businesses around the world to look for ways to partake in this opportunity, Siu said that the way crypto regulation has been moving forward in Asia signifies that the U.S. ETF approval will positively impact the region more than others.",
    "“There's regulatory clarity and there's this willingness from, basically governments and regulators to sort of build this ecosystem and partake and see the opportunities that [are] out there,” Siu added.",
    "Even as the SEC announced the ETF approval, its chair Gary Gensler stood by his stance on crypto where he said the decision “should in no way signal the Commission’s willingness to approve listing standards for crypto asset securities.”",
    "Siu pointed out that Asian investors, especially the younger generation, tend to have a more open view towards capitalism on average compared to those in the U.S. “If I was to put sort of a comment around this, I would say that the American dream is more alive and well in Asia than it is in America,” he said.",
    "“In Asia, even though there's also, of course, inequity, capitalism has broadly been of benefit to this and the last generation,” Siu commented. “I mean, look at China, look at South Korea, Southeast Asia, just generally speaking, these are all countries that 30 years ago were literally nowhere, like they had nothing, in many cases,” the Animoca co-founder explained.",
    "Brian Hoonjong Baik, co-founder and chief operating officer of crypto management platform SmashFi, bolstered the view of U.S. spot bitcoin ETF approval’s major impact on Asia. “Asian investors have always been more adventurous than their Western counterparts, right from bitcoin's early days. An ETF would be like a perfect marriage between crypto and regulation, easing worries for institutional investors who've been looking for a legitimate way to build a crypto portfolio.”",
    "Chong Kok Kee, CEO of AsiaNext, an institution-only crypto exchange, explained that crypto adoption in Asia is higher than other continents, with Central and South Asia being the top regions. “The Asian market, known for its preference for stable investments, might see a mindset shift in viewing crypto as an investment asset besides its transactional purpose, as the ETF provides a regulated and lower-risk avenue for investment exposure to cryptocurrencies,” Chong said.",
    "Who's next?",
    "Following the U.S. ETF approval, which Coinbase dubbed a “watershed moment” for crypto, Asian jurisdictions may next push out such spot crypto products.",
    "Hong Kong, which underwent a major regulatory renewal last year to reclaim its position as the region’s crypto hub, could be next to introduce a spot crypto ETF in Asia, several regional experts suggested.",
    "“In Asia, Hong Kong is definitely the prime candidate for the next spot crypto ETF. Aligning with its crypto hub ambitions, Hong Kong regulators have already sent a clear message that there is an appetite to consider spot crypto ETFs, including for retail,” Angela Ang, a former Monetary Authority of Singapore regulator and senior policy advisor at blockchain intelligence firm TRM Labs, told The Block.",
    "“The next step is aligning regulatory and industry expectations on controls and compliance, in order to make this a reality,” Ang added.",
    "Keep up with the latest news, trends, charts and views on crypto and\n          DeFi with a new biweekly newsletter from The Block's Frank Chaparro",
    "It appears that Hong Kong, a financial hub and a regulatory testbed for China, is already on the move. Livio Weng, COO of Hong Kong-based crypto exchange HashKey, said Wednesday that 10 fund managers, including those backed by Chinese capital, are looking into launching spot crypto ETFs in the city.",
    "In December, Hong Kong’s Securities and Futures Commission and the Hong Kong Monetary Authority, the city’s de facto central bank, announced that both agencies have reviewed their existing policy. The regulators published two circulars addressing the requirements for spot crypto ETFs.",
    "Johnny Ng, a Hong Kong lawmaker, said today on X that Hong Kong should “take the lead” in the crypto space by introducing spot crypto ETFs. “I hope that Hong Kong, amidst rapid development and intense competition in the virtual asset sector, can swiftly secure a position globally, particularly by taking the lead in implementing relevant policies and products in Asia,” he added.",
    "Singapore, another major financial hub, could also be a potential contender for the spot crypto ETF race in Asia. “Singapore’s mature regulatory environment has positioned itself as a mature and leading jurisdiction to oversee structured spot crypto products,” said Wayne Huang, co-founder and group CEO of Taiwan-headquartered crypto exchange XREX.",
    "Ko Jangdeok, CEO of SBINFT, the non-fungible token subsidiary under the Japanese financial services conglomerate SBI Group, expects significant regulatory movement in Japan in the near future. “The approval of spot ETFs in the U.S. is likely to have a highly positive impact on policymakers in Japan. It wouldn't be surprising to witness an acceleration in discussions about a ‘Japanese version of an ETF.’”",
    "Variables remain",
    "Nevertheless, there are still variables for Asia in launching its spot crypto ETFs. One may be the employment of capital inflows in Asia compared to the vast amount in the U.S. “The United States has a well-established foundation in this aspect. Although Asia is not inferior, the success factor lies in how effectively the finance sector and funds can be integrated,” Ko said.",
    "Another factor lies in how progressive the region’s regulators will be, as the crypto industry is still battling unpredictable volatility and trust issues from hacks and bankruptcies.",
    "“Hong Kong and Singapore have become more cautious in encouraging retail participation in virtual assets investments, especially after the two cities’ residents suffered losses, from the likes of JPEX in Hong Kong and the collapse of FTX,” said Patricia Ho, general counsel of Scroll, an Ethereum Layer 2 network.",
    "“In the short term, we may also be seeing more enforcement in Hong Kong, which may dampen investor appetite. In the medium and longer term, I expect that there will be a pick up in interest and investor appetite in virtual assets locally, with bitcoin halving, approval of virtual assets trading platforms by SFC and new Hong Kong stablecoin regulations later this year,\" Ho added.",
    "Potential approaches",
    "Asset managers in Hong Kong may consider rolling out products through a fund-of-funds structure to provide their investors with exposure to bitcoin, as suggested by Glenn Woo, head of sales of APAC at web3 infrastructure firm Blockdaemon.",
    "“Hong Kong ETF issuers have the option to create a 'fund of funds,' which basically wraps an ETF from outside of Hong Kong,” said Woo, who has over a decade of experience in the traditional financial industry in Hong Kong. “I can see that thematic ETFs, such as technology [or] blockchain ETFs, through a fund-of-funds structure, would be able to actually put these bitcoin ETFs into a basket.”",
    "Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in other companies in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current financial disclosures.",
    "© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.",
    "South Korean blockchain Klaytn onboards gold RWA DeFi platform",
    "MicroStrategy co-founder Saylor to sell $216 million worth of company shares",
    "Bitcoin rises past $45,000 amid US spot bitcoin ETF approval anticipation",
    "Hong Kong lawmaker calls for swift action following US spot bitcoin ETF greenlight"
  ]
}
,{
  "title": "Crypto leaders foresee maturation after spot bitcoin ETF approval amid volatility concerns",
  "source": "Timmy Shen",
  "date": "January 10, 2024, 9:53PM EST",
  "content": [
    "Prominent figures in the crypto industry have expressed optimism about increased crypto adoption and a more mature crypto market following the U.S. approval of spot bitcoin ETFs, while analysts warned about potential risks related to bitcoin price volatility.",
    "Anthony Scaramucci, former White House communications director and now founding and managing partner at SkyBridge Capital, said in a statement shared with The Block that the approval of spot bitcoin ETFs signifies the recognition of bitcoin as a “legitimate asset.”",
    "“We believe this approval will pave the way for greater mainstream education and acceptance around the merits and utility of blockchain-based assets and infrastructure,” Scaramucci added.",
    "The Securities and Exchange Commission today announced the approval of spot bitcoin ETFs, with 11 such ETFs set to start trading as soon as Thursday. The 11 tradable spot bitcoin ETFs approved on Wednesday are funds from Bitwise, Grayscale, Hashdex, BlackRock, Valkyrie, BZX, Invesco, VanEck, WisdomTree, Fidelity and Franklin Templeton.",
    "“Today will be remembered in crypto history,” said Richard Teng, the new chief executive officer of Binance, the world’s largest crypto exchange. “Spot bitcoin ETFs have arrived, giving BTC access to a whole new class of investors and making Bitcoin a more approachable asset for many crypto-curious,” he wrote in a post on X.",
    "Asset managers remain optimistic",
    "With the approval, Grayscale turned its flagship Grayscale Bitcoin Trust (GBTC) into a spot bitcoin ETF, following a long journey and an August court win that ruled that the SEC had to re-review Grayscale's bid for a spot bitcoin ETF.",
    "Barry Silbert, founder and CEO of Digital Currency Group, the parent of Grayscale, said that GBTC, since its launch in 2013 in the U.S., has garnered nearly one million investors and amassed over $28 billion in assets under management, accompanied by daily trading volumes reaching into the hundreds of millions of dollars.",
    "“Grayscale deserves a huge amount of credit for today, pushing this through the courts,” Brian Armstrong, co-founder and CEO of Coinbase, which serves as custodian to eight spot bitcoin ETFs, said in an X post today.",
    "Cynthia Lo Bessette, head of digital asset management of Fidelity, noted in a statement sent to The Block that the affirmation of this approval signals positive momentum for the industry. “We’ve long believed a spot-priced exchange traded-product would be an efficient way for investors to gain exposure to bitcoin.”",
    "Keep up with the latest news, trends, charts and views on crypto and\n          DeFi with a new biweekly newsletter from The Block's Frank Chaparro",
    "VanEck CEO Jan van Eck said in a blog post that with many spot bitcoin ETFs coming to the market, one way for investors to decide which ETF to invest in is to “consider the commitment of the ETF sponsors.”",
    "“We also know that investing in bitcoin is difficult due to its newness and volatility, among other risks,” he wrote. “This is why we scream for investors to dollar cost average — start right away (small) but dollar cost average over time and Hold On for Dear Life (or HODL).”",
    "Meanwhile, the boss of stablecoin issuer Tether said the ETFs are expected to lead to a surge in widespread adoption. “Such increased interest and legitimacy are likely to spark a wave of innovation, attracting more talent and capital into the industry,” Paolo Ardoino, CEO of Tether and CTO of Bitfinex, said in a statement.",
    "Potential risks",
    "While the crypto industry celebrates the approval, SEC Chair Gary Gensler said Wednesday that the agency was not endorsing bitcoin as it approved spot bitcoin ETFs.",
    "Gensler noted that the SEC’s decision “should in no way signal the Commission’s willingness to approve listing standards for crypto asset securities.”",
    "“Nor does the approval signal anything about the Commission’s views as to the status of other crypto assets under the federal securities laws or about the current state of non-compliance of certain crypto asset market participants with the federal securities laws,” he continued.",
    "Rajeev Bamra, SVP of digital finance at rating agency Moody’s Investors Service, expressed that the ETF approval could lead to a more stable and liquid crypto market. However, the sustainability of this positive trend “depends on the trajectory of global monetary policy-making” and the availability of crypto to institutional investors through compliant products.",
    "“The notorious price volatility of Bitcoin, as well as its fluctuating values against stablecoins and other cryptocurrencies, could expose mainstream investors to a less familiar spectrum of investment risks,” said Yiannis Giokas, senior director of Moody’s Analytics.",
    "Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in other companies in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current financial disclosures.",
    "© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.",
    "Bitcoin rises past $45,000 amid US spot bitcoin ETF approval anticipation",
    "Vitalik Buterin says original Web3 visions have ‘faded into the background’"
  ]
}
]